// bookname.js
const imageName = [
    '黄帝九章算经细草',//0
    '五经算术',//1
    '同文算指',//2
    '几何原本译本',//3

    '缀术',//4
    '算罔论',//5
    '圜容较义',//6
    '梦溪笔谈',//7
    '授时历',//8

    '缉古算经',//9
    '五曹算经',//10
    '数书九章',//11
    '测圆海镜',//12
    '垛积比类',//13
    '考工记',//14
    '杨辉算法',//15
    '四元玉鉴',//16
    '算学启蒙',//17
    '议古根源',//18

    '张丘建算经',//19
    '周髀算经',//20

    '勾股圆方图注',//21
    '垛积比类',//22
    '衡斋算学',//23
    '数理精蕴',//24
    '崇祯历书',//25
    '圜容较义',//26
    '数度衍',//27
    '测量全义',//28
    '割圆八线表',//29
    '大测',//30
    '益古演段',//31

    '梅氏丛书辑要',//32
    '九章算术',//33
    '史记 夏纪本',//34
    '历学会通'//35
];

export default imageName;