// radarData.js
const radarData = [
    {"name": "黄帝九章算经细草", "value": [3, 7, 2, 0, 0, 2]},
    {"name": "五经算术", "value": [1, 1, 7, 0, 0, 3]},
    {"name": "同文算指", "value": [6, 8, 4, 0, 0, 1]},
    {"name": "几何原本译本", "value": [2, 4, 9, 0, 0, 3]},

    {"name": "缀术", "value": [7, 8, 6, 0, 0, 2]},
    {"name": "算罔论", "value": [7, 3, 1, 0, 0, 4]},
    {"name": "圜容较义", "value": [3, 2, 7, 0, 0, 1]},
    {"name": "梦溪笔谈", "value": [6, 8, 6, 0, 0, 4]},
    {"name": "授时历", "value": [4, 1, 3, 8, 0, 2]},

    {"name": "缉古算经", "value": [6, 6, 7, 0, 0, 3]},
    {"name": "五曹算经", "value": [6, 6, 6, 0, 0, 1]},
    {"name": "数书九章", "value": [8, 9, 7, 7, 4, 4]},
    {"name": "测圆海镜", "value": [1, 8, 9, 0, 0, 3]},
    {"name": "垛积比类", "value": [4, 8, 2, 0, 0, 1]},
    {"name": "考工记", "value": [3, 4, 7, 0, 0, 2]},
    {"name": "杨辉算法", "value": [2, 8, 1, 0, 10, 4]},
    {"name": "四元玉鉴", "value": [9, 3, 4, 0, 0, 8]},
    {"name": "算学启蒙", "value": [7, 8, 7, 0, 0, 1]},
    {"name": "议古根源", "value": [4, 8, 6, 0, 0, 3]},

    {"name": "张丘建算经", "value": [6, 6, 6, 0, 0, 2]},
    {"name": "周髀算经", "value": [3, 3, 8, 8, 0, 4]},

    {"name": "勾股圆方图注", "value": [3, 1, 8, 0, 0, 2]},
    {"name": "垛积比类", "value": [4, 8, 3, 0, 0, 1]},
    {"name": "衡斋算学", "value": [6, 8, 3, 0, 0, 4]},
    {"name": "数理精蕴", "value": [6, 6, 6, 6, 0, 3]},
    {"name": "崇祯历书", "value": [4, 4, 6, 6, 0, 1]},
    {"name": "圜容较义", "value": [2, 1, 7, 0, 0, 3]},
    {"name": "数度衍", "value": [8, 3, 2, 0, 0, 4]},
    {"name": "测量全义", "value": [1, 3, 7, 0, 0, 2]},
    {"name": "割圆八线表", "value": [4, 2, 7, 0, 0, 1]},
    {"name": "大测", "value": [3, 4, 7, 8, 0, 2]},
    {"name": "益古演段", "value": [1, 8, 6, 0, 0, 3]},

    {"name": "梅氏丛书辑要", "value": [6, 6, 6, 0, 0, 4]},
    {"name": "九章算术", "value": [9, 9, 9, 0, 4, 2]},
    {"name": "史记 夏纪本", "value": [3, 2, 7, 0, 0, 4]},
    {"name": "历学会通", "value": [3, 3, 7, 7, 0, 2]}
];
export default radarData;